# с venv:
# у каждого проекта свои библеотеки
# можно ставить разные версии
# проекты не мишает друг другу


# # python manage.py makemigrations # Создает миграции на основе изменений в моделях
# # # Применяет миграции к базе данных





# Что такое venv?

# venv (virtual environment) — это изолированная среда для Python проекта

# Проще:

# это отдельное место
# где хранятся библиотеки только для одного проекта


# Зачем нужен venv?

# Без venv:

# все библиотеки ставятся глобально
# версии могут конфликтовать
# проекты ломаются

# С venv:
# у каждого проекта свои библиотеки
# можно ставить разные версии
# проекты не мешают друг другу


# python -m venv venv # Создает виртуальное окружение в папке venv
# .\venv\Scripts\activate # Активирует виртуальное окружение (Windows)
# source venv/bin/activate # Активирует виртуальное окружение (Linux/Mac)

# pip install django # Устанавливает Django в виртуальное окружение
# django-admin startproject core . # Создает новый проект Django в текущей папке
# python manage.py startapp main # Создает новое приложение Django с именем main
# python manage.py migrate # Применяет миграции к базе данных
# python manage.py runserver # Запускает сервер разработки Django
# python manage.py createsuperuser # Создает суперпользователя для доступа к админке Django



# Django — это фреймворк на Python для веб-разработки.
# Он помогает быстро создавать сайты и веб-приложения.
















# Django — это фреймворк на Python для веб-разработки.
# Он помогает быстро создавать сайты и веб-приложения.
# Основан на принципе MTV (Model–Template–View) — 
#                          это похоже на MVC (Model–View–Controller).


# Model — это работа с данными (как таблица в базе данных).
# Template — это внешний вид (HTML-страницы).
# View — это логика (код, который обрабатывает запросы).



# Библиотека — это как набор инструментов (молоток, отвертка, линейка). 
# Ты сам решаешь, как их использовать.

# Фреймворк — это уже половина построенного дома, в который ты вставляешь 
# свои окна и двери. Он задаёт структуру проекта.

